package com.example.serveresmfamil.Models;

public class Dictionary {
    public static final String[] names = {"آرزو","امیر","آرش","آرمان","آرمین","بهروز","بهبود","بهناز","پونه","پناه","پوریا","پگاه","ترنم","تینا","توماس","ثنا","ثریا","جعفر","جواد","جاوید","چنگیز","چترا","چکامه","حمید","حامد","حسن","خسرو","خلیل","دینا","داوود","دنیا","ذوالفقار","ریما","رامین","روشنک","رها","زیبا","زینب","زهره","زهرا","ژاله","ژیلا","ژینوس","سیمین","سولماز","ساسان","شیرین","شهاب","شکوه","شکوفه","صاحب","صابر","ضیا","طاها","طناز","طاهر","ظهیر","ظفر","عارف","عرفان","عباس","علی","غزاله","غلام‌رضا","غلام","فاطمه","فهیمه","فرهاد","فرزاد","فریبا","قنبر","قاسم","قاصدک","کامران","کامبیز","کمال","گلرخ","گلاره","گوهر","لاله","لیلا","لادن","مریم","محمد","مینا","محسن","نیما","نوشین","ناهید","ناصری","ولی","وحید","هدیه","هادی","هلیا","یاسر","یاس","یاسمن","یلدا"};
    public static final String[] things = {"استکان","آب پاش","اره","بیل","بابلیس","بخاری","پارو","پنبه","پارچ","تاب","تنیس","توپ","تاس","ثانیه شمار","جعبه","جاروبرقی","چتر","چکش","چسب","حوله","حسگر","خیمه","خطکش","داس","دمپایی","ذره","بین","رادار","رادیو","رنده","زین","زنجیر","زنگ","ژیلت","سوزن","سبد","شیشه","شانه","صندوق","ضبط","طبل","طناب","ظرف","عصا","عینک","غذا ساز","فرفره","فرش","قرقره","قاشق","قالی","کاردستی","کاور","کیف","گوشواره","گاری","لامپ","لوستر","لوله","منگنه","میز","میخ","نلبکی","نمکدان","نخ","وان","هاون","یخچال","یونولیت"};
    public static final String[] clothes = {"آستین کوتاه","بارانی","بلوز","پلیور","پوتین","پیژامه","پالتو","پیراهن","تنبان","تیشرت","تاپ","تونیک","جوراب","جلیقه","چادر","چارقد","چکمه","حوله","دامن","دشداشه","دستکش","روسری","روپوش","روبان","رکابی","ژاکت","ژیلت","ساق دست","سویشرت","سارافون","سوتین","سرهمی","ساپورت","شال","شورت","شلوارک","شورتک","شنل","شلوار","صندل","ضد گلوله","عبا","عینک","عمامه","غواصی","فضانوردی","قبا","قنداق","کت","کاپشن","کلاه","کفش","کمربند","گیوه","گیپور","لامبادا","لگ","مانتو","مقنعه","مایو","نیم تنه","نافبند","نیم آستین","ورزشی","هد","هدبند","هودی"};
    public static final String[] animals = {"اسب","اردک","آهو","ببر","بز","بوزینه","پلنگ","پشه","پرستو","تمساح","تیهو","ثعبان","جوجه تیغی","جغذ","چکاوک","چلچله","حلزان","خوک","خر","دارکوب","دلفین","روباه","راسو","زرافه","زنبور","ژورک","ژوژه","سمندر","سگ","شاهین","شیر","شتر","صدف","دریایی","طاووس","طوطی","عقاب","عقرب","عنکبوت","غزال","غاز","فک","فیل","فلامینگو","قو","قورباغه","کبک","گوزن","گاو","گوسفند","گرگ","لاک پشت","لک لک","مورچه","مار","میمون","نهنگ","وال","هدهد","یوزپلنگ"};
    public static final String[] city = {"آستارا","آمل","آبادان","اهواز","بیرجند","بروجرد","بابل","پیرانشهر","پاوه","تاکستان","تبریز","تهران","ثلاث","باباجانی","جیرفت","جاجرود","چالوس","چابهار","حسن آباد","حمیدیه","خوزستان","خمین","دبی","دامغان","دزفول","ذوق آباد","رامسر","رشت","ری","رم","زاهدان","زابل","ژوهانسبورگ","سیسنگان","سامرا","شاهرود","شوش","شوشتر","صدر آّباد","ضیاآباد","طارم","طبس","ظفرآباد","عسلویه","علی آباد","کتول","غرق آباد","فیروزکوه","فسا","فومن","قزوین","قاین","قم","کرج","کازرون","گنبدکاووس","گرگان","لاهیجان","لار","مشکین‌شهر","مریوان","مراغه","نورآباد","نهاوند","ورزنه","ورامین","هرمزگان","همدان","یزد","یاسوج"};
    public static final String[] food = {"انارپلو","اشکنه","املت","اسفناج پلو","آلبالوپلو","آش","آبگوشت","آبدوغ خیار","آلو مسما","بیف استراگانف","برنج","باقالی پلو","بوقلمون","به پلو","برگر","بورانی","پاستا","پیتزا","پوره سیب زمینی","پلو","ته چین","ترخینه","ترشی تره","تاس کباب","ثرید","ثریایی","جوجه کباب","جعفری پلو","جیگر","جامبو","جازگ","چلو کباب","چنجه","چلو مرغ","چلو گوشت","چکدرمه","چغور پغور","حلیم بادمجان","حلوا","حریره بادام","حراروت","خورشت بادمجان","خاگینه","خورشت آلو","خوراک لوبیا","خاویار","دلمه","دم پختک","دمی گوجه","دندونی","دال عدس","دیزی","ذرت پلو","ذرت مکزیکی","رنگینک","رشته پلو","رشته","رولت مرغ","راتاتویی","رولت ماهی","رولت گوشت","راویولی","ریواس پلو","زرشک پلو","زردک پلو","ژامبون","ژیگو","ژلاتین","ژله","سمبوسه","سمنو","سالادالویه","سوتلاچ","شویدپلو","شعله زرد","شیشلیک","شاه میگو","شوربا","شامی","شیرین پلو","شیوید باقالی","صدف","صدف شکم پر","عدسی","عدس پلو","غاز شکم پر","غوره مسما","فسنجان","فلافل","فیله مرغ","فرنی","فروماژ","قورمه سبزی","قیمه","قروتی","قلیه ماهی","قیمه نثار","کتلت","کلم پلو","کوکو","کباب","کالباس","کشک بادمجان","کله پاچه","کرم کارامل","کوفته تبریزی","گوشت کوبیده","گوله ریزه","گردن پلو","لوبیا پلو","لازانیا","لبو","لاح معجون","ماهی شکم پر","مانی پلو","میرزاقاسمی","ماکارونی","مرصع پلو","ماهی","میگو","مرغ شکم پر","نخود پلو","نیمرو","نرگسی","ناگت مرغ","نیمرو","نودلا","والک پلو","واویشکا","ورکوآز","همبرگر","هویج پلو","هات داگ","هلو کباب","یتیمچه","یخنی"};
    public static final String[] famil = {"آوایی","اصغری","اقبالی","اسعدی","بهبودی","بارانی","بهروزی","پگاهی","پناهی","پورمند","تیموری","تبریزی","ثروتمند","ثنایی","جوادی","جوادپور","جعفری","چمران","چنگیزی","چمنی","حسینی","حمیدی","حاتمی","خلیلی","خسروی","داوودی","داوری","ذوالفقاری","ذبیحی","رضایی","رضاپور","رامینی","زاهدی","فر","زالی","زاهدی","ژوله","ساسانی","سعیدی","سعیدپور","شهابی","شیخ","رسولی","شاهانی","صارمی","صباحی","ضیایی","طیبی","طاهایی","طاهری","ظفری","ظهیری","عبدی","علیزاده","علیپور","غلامی","غفرانی","فرزادی","فاطمی","فرهادی","قاسمی","قنبری","قاصدی","کمالی","کمالپور","کامرانی","گوهری","گلزار","لهراسبی","لادنی","محسنی","محمدی","میرزاپور","مقدم","نادری","ناصر","ناهیدی","وحیدی","ولیزاده","هاشمی","هاشم‌پور","یاسری","یحیوی"};
    public static final String[] country = {"اتریش","ایران","ایتالیا","آلبانی","برزیل","بوسنی","پرتغال","پرو","پاراگوئه","تایلند","تانزانیا","ترکمنستان","جبل","الطارق","جیبوتی","جامایکا","چک","چین","چین","تایپه","حبشه","خرونا","خمیس","دانمارک","ذمار","روسیه","رومانی","زامبیا","ژاپن","سوئد","سومالی","شیلی","صربستان","طبرستان","عمان","عربستان","عراق","غنا","فلسطین","فنلاند","فرانسه","قرقیزستان","قزاقزستان","کویت","کرواسی","کامبوج","گرجستان","لیبی","لبنان","لهستان","مالزی","مصر","مالی","مقدونیه","نیجریه","نپال","نروژ","ولز","واتیکان","ویتنام","هنگ","کنگ","هلند","هند","یمن","یونان"};
    public static final String[] flower = {"آفتابگردان","آلاله","بنفشه","بابونه","پامچال","پونه","تاج","خروس","ثعلب","جاسمین","چتری","چای","حسنی","یوسف","خارخاسک","خارشتر","داوودی","رز","ریحان","رازقی","زنبق","ژاله","ستاره","سنبل","سوسن","شقایق","شیپوری","صنوبر","طاووسی","عروس","فلورال","قاصدک","کاکتوس","گندم","گلایل","لاله","مریم","محمدی","نیلوفر","نرگس","ونوس","همیشه بهار","یاسمن","یاس","یاقوت"};
    public static final String[] cars = {"آزرا","اونتادور","آئودی","بی ام و","بوگاتی","بنز","پاترول","پژو","پورشه","تراکتور","تویتا","تیبا","جیپ","جنسیس","چری","حافی","لوبو","خاور","دوو","دنا","رنو","ریو","زامیاد","زانتیا","ژیان","سمند","شورلت","صحرا","صبا","طوفان","غلتک","فلوکس","فراری","قشقایی","کامیون","گلف","گل","لامبورگینی","لکسوس","لندکروز","مزدا","میتسوبیشی","ماتیز","نیسان","ولوو","هیوندای","یاریس","یاماها"};
    public static final String[] fruit = {"انبه","آلبالو","آلو","انگور","به","پرتقال","توت","ترنج","توت","فرنگی","جز","هندی","جمبو","چاقاله","بادام","حصرم","خیار","خرمالو","خربزه","دستنبو","ذغال","اخته","ریواس","زردآلو","زنجبیل","ژاژ","سیب","شفتالو","شلیل","طالبی","عناب","غوره","فندق","قیسی","کیوی","گیلاس","گلابی","گوجه","سبز","لیموشیرین","موز","نارگیل","نارنج","نارنگی","ولیک","هندوانه","هلو","یافا"};

    public String[] getNames() {
        return names;
    }

    public String[] getThings() {
        return things;
    }

    public String[] getClothes() {
        return clothes;
    }

    public String[] getAnimals() {
        return animals;
    }

    public String[] getCity() {
        return city;
    }

    public String[] getFood() {
        return food;
    }

    public String[] getFamil() {
        return famil;
    }

    public String[] getCountry() {
        return country;
    }

    public String[] getFlower() {
        return flower;
    }

    public String[] getCars() {
        return cars;
    }

    public String[] getFruit() {
        return fruit;
    }
}
